src/app/Http/Controllers/Payment/ZalopayController.php

    public function pay(Request $request) {
        date_default_timezone_set('Asia/Ho_Chi_Minh');
        $orderComnined = CombinedOrder::findOrFail($request->session()->get('combined_order_id'));
        $order = Order::where('combined_order_id',$orderComnined->id)->first();
---
select * from `combined_orders` where `combined_orders`.`id` = 80 limit 1
select * from `orders` where `combined_order_id` = 80 limit 1