src/app/Http/Controllers/CheckoutController.php

    public function checkout(Request $request)
    {
        // return $request;
        // if guest checkout, create user
        if(auth()->user() == null){
            $guest_user = $this->createUser();
            if($guest_user == 0){
                flash(translate('Please try again later.'))->warning();
                return redirect()->route('checkout.shipping_info');
            }
        }

        if ($request->payment_option == null) {
            flash(translate('There is no payment option is selected.'))->warning();
            return redirect()->route('checkout.shipping_info');
        }
        $user = auth()->user();
        $carts = Cart::where('user_id', $user->id)->get();
---
select * from `carts` where `user_id` = 11

        (new OrderController)->store($request);

        if(count($carts) > 0){
            Cart::where('user_id', $user->id)->delete();
---
delete from `carts` where `user_id` = 11

    public function get_shipping_info(Request $request)
    {
        if(get_setting('guest_checkout_activation') == 0 && auth()->user() == null){
            return redirect()->route('user.login');
        }

        if (auth()->user() != null) {
            $user_id = Auth::user()->id;
            $carts = Cart::where('user_id', $user_id)->get();
        }
        else {
            $temp_user_id = $request->session()->get('temp_user_id');
            $carts = ($temp_user_id != null) ? Cart::where('temp_user_id', $temp_user_id)->get() : [];
        }
        if ($carts && count($carts) > 0) {
            $categories = Category::all();
---
select * from `carts` where `user_id` = 11
select * from `categories`


        if (auth()->user() != null) {
            $user_id = auth()->user()->id;
            $carts = Cart::where('user_id', $user_id)->get();
---
select * from `carts` where `user_id` = 11

        if (auth()->user() != null) {
            foreach ($carts as $key => $cartItem) {
                $cartItem->address_id = $request->address_id;
                $cartItem->save();
---
update `carts` set `address_id` = '2', `carts`.`updated_at` = '2024-03-27 00:53:03' where `id` = 80

    public function store_delivery_info(Request $request)
    {
        $carts = auth()->user() != null ?
                Cart::where('user_id', auth()->user()->id)->get() :
                Cart::where('temp_user_id', $request->session()->get('temp_user_id'))->get();

        if ($carts->isEmpty()) {
            flash(translate('Your cart is empty'))->warning();
            return redirect()->route('home');
        }

        $shipping_info = Address::where('id', $carts[0]['address_id'])->first();
        $total = 0;
        $tax = 0;
        $shipping = 0;
        $subtotal = 0;

        if ($carts && count($carts) > 0) {
            foreach ($carts as $key => $cartItem) {
                $product = Product::find($cartItem['product_id']);
---
select * from `carts` where `user_id` = 11
select * from `addresses` where `id` = 2 limit 1
select * from `products` where `products`.`id` = 1 limit 1

                }

                $shipping += $cartItem['shipping_cost'];
                $cartItem->save();
---
update `carts` set `shipping_type` = 'home_delivery', `carts`.`updated_at` = '2024-03-27 00:53:05' where `id` = 80