src/app/Http/Controllers/HomeController.php

    public function dashboard()
    {
        if (Auth::user()->user_type == 'seller') {
            return redirect()->route('seller.dashboard');
        } elseif (Auth::user()->user_type == 'customer') {
            $users_cart = Cart::where('user_id', auth()->user()->id)->first();
---
select * from `carts` where `user_id` = 11 limit 1

    public function product(Request $request, $slug)
    {
        if (!Auth::check()) {
            session(['link' => url()->current()]);
        }

        $detailedProduct  = Product::with('reviews', 'brand', 'stocks', 'user', 'user.shop')->where('auction_product', 0)->where('slug', $slug)->where('approved', 1)->first();

        if ($detailedProduct != null && $detailedProduct->published) {
            if ((get_setting('vendor_system_activation') != 1) && $detailedProduct->added_by == 'seller') {
                abort(404);
            }

            if ($detailedProduct->added_by == 'seller' && $detailedProduct->user->banned == 1) {
                abort(404);
            }

            if (!addon_is_activated('wholesale') && $detailedProduct->wholesale_product == 1) {
                abort(404);
            }

            $product_queries = ProductQuery::where('product_id', $detailedProduct->id)->where('customer_id', '!=', Auth::id())->latest('id')->paginate(3);
            $total_query = ProductQuery::where('product_id', $detailedProduct->id)->count();
---
select * from `brands` where `brands`.`id` in (1)
select * from `products` where `auction_product` = 0 and `slug` = '123' and `approved` = 1 limit 1
select * from `shops` where `shops`.`user_id` in (9)
select * from `users` where `users`.`id` in (9)
select count(*) as aggregate from `product_queries` where `product_id` = 1 and `customer_id` != 11
select count(*) as aggregate from `product_queries` where `product_id` = 1

            // review status
            $review_status = 0;
            if (Auth::check()) {
                $OrderDetail = OrderDetail::with(['order' => function ($q) {
                    $q->where('user_id', Auth::id());
                }])->where('product_id', $detailedProduct->id)->where('delivery_status', 'delivered')->first();
---
select * from `order_details` where `product_id` = 1 and `delivery_status` = 'delivered' limit 1

    public function all_categories(Request $request)
    {
        $categories = Category::with('childrenCategories')->where('parent_id', 0)->orderBy('order_level', 'desc')->get();
---
select * from `categories` where `parent_id` = 0 order by `order_level` desc

    public function variant_price(Request $request)
    {
        $product = Product::find($request->id);
---
select * from `products` where `products`.`id` = '1' limit 1

    public function get_category_items(Request $request)
    {
        // $category = Category::findOrFail($request->id);
        $categories = Category::with('childrenCategories')->findOrFail($request->id);
---
select * from `categories` where `categories`.`id` = '1' limit 1